SChristophS/GrowBox_NG/growbox-controller/STM32f4_GCU/Core/Src/main.c
/* Definitions for xWaterCommandQueue */
osMessageQueueId_t xWaterCommandQueueHandle;
uint8_t xWaterCommandQueueBuffer[ 3 * 4 ];
osStaticMessageQDef_t xWaterCommandQueueControlBlock;
const osMessageQueueAttr_t xWaterCommandQueue_attributes = {
  .name = "xWaterCommandQueue",
  .cb_mem = &xWaterCommandQueueControlBlock,
  .cb_size = sizeof(xWaterCommandQueueControlBlock),
  .mq_mem = &xWaterCommandQueueBuffer,
  .mq_size = sizeof(xWaterCommandQueueBuffer)
};
/* Definitions for xLightCommandQueue */
osMessageQueueId_t xLightCommandQueueHandle;
uint8_t xLightCommandQueueBuffer[ 3 * 4 ];
osStaticMessageQDef_t xLightCommandQueueControlBlock;
const osMessageQueueAttr_t xLightCommandQueue_attributes = {
  .name = "xLightCommandQueue",
  .cb_mem = &xLightCommandQueueControlBlock,
  .cb_size = sizeof(xLightCommandQueueControlBlock),
  .mq_mem = &xLightCommandQueueBuffer,
  .mq_size = sizeof(xLightCommandQueueBuffer)
};
/* Definitions for gControllerStateMutex */
osMutexId_t gControllerStateMutexHandle;
osStaticMutexDef_t gControllerStateMutexControlBlock;
const osMutexAttr_t gControllerStateMutex_attributes = {
  .name = "gControllerStateMutex",
  .cb_mem = &gControllerStateMutexControlBlock,
  .cb_size = sizeof(gControllerStateMutexControlBlock),
};
/* Definitions for gGrowCycleConfigMutex */
osMutexId_t gGrowCycleConfigMutexHandle;
osStaticMutexDef_t gGrowCycleConfigMutexControlBlock;
const osMutexAttr_t gGrowCycleConfigMutex_attributes = {
  .name = "gGrowCycleConfigMutex",
  .cb_mem = &gGrowCycleConfigMutexControlBlock,
  .cb_size = sizeof(gGrowCycleConfigMutexControlBlock),
};
/* Definitions for gControllerEventGroup */
osEventFlagsId_t gControllerEventGroupHandle;
osStaticEventGroupDef_t gControllerEventGroupControlBlock;
const osEventFlagsAttr_t gControllerEventGroup_attributes = {
  .name = "gControllerEventGroup",
  .cb_mem = &gControllerEventGroupControlBlock,
  .cb_size = sizeof(gControllerEventGroupControlBlock),
};
/* USER CODE BEGIN PV */

// Definiere hier deine globalen Variablen
ControllerState gControllerState;
GrowCycleConfig gGrowCycleConfig;

char uidStr[25];

// Mutexe und Event-Gruppen
osMutexId_t gControllerStateMutexHandle;
osMutexId_t gGrowCycleConfigMutexHandle;
osEventFlagsId_t gControllerEventGroupHandle;

// Queues
osMessageQueueId_t xWaterControllerQueueHandle;
osMessageQueueId_t xLightControllerQueueHandle;
osMessageQueueId_t xWebSocketQueueHandle;
osMessageQueueId_t xHardwareQueueHandle;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_SPI1_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_SPI2_Init(void);
static void MX_TIM3_Init(void);
static void MX_TIM6_Init(void);
static void MX_TIM10_Init(void);
static void MX_I2C2_Init(void);
void StartAliveTask(void *argument);
void StartNetworkTask(void *argument);
void StartWaterControllerTask(void *argument);
void StartLightTask(void *argument);
void StartSensorTask(void *argument);
void StartHardwareTask(void *argument);

/* USER CODE BEGIN PFP */
void InitControllerState(void);
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
// UID auslesen und anzeigen
void GetSTM32UID(char *uidStr) {
    uint32_t uid[3];
    uid[0] = *(uint32_t *)0x1FFF7A10;
    uid[1] = *(uint32_t *)0x1FFF7A14;
    uid[2] = *(uint32_t *)0x1FFF7A18;

    if (sprintf(uidStr, "%08lX%08lX%08lX", uid[0], uid[1], uid[2]) < 0) {
        printf("task_network.c:\t - Error formatting UID string\r\n");
        return;
    }
}





/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_SPI1_Init();
  MX_USART2_UART_Init();
  MX_SPI2_Init();
  MX_TIM3_Init();
  MX_TIM6_Init();
  MX_TIM10_Init();
  MX_I2C2_Init();
  /* USER CODE BEGIN 2 */

  printf("main.c:\t - NextGeneration Growbox Project - \r\n");

  resetAssert();
  HAL_Delay(300);
  resetDeassert();
  HAL_Delay(300);


  // Initialisiere gControllerState
  gControllerState.wasserbeckenZustand = false;
  gControllerState.pumpeZulauf = false;
  gControllerState.pumpeAblauf = false;
  gControllerState.sensorOben = false;
  gControllerState.sensorUnten = false;
  gControllerState.lightIntensity = 0;
  gControllerState.automaticMode = false;





  printf("main.c:\t - done\r\n");



  GetSTM32UID(uidStr);
  printf("main.c:\t STM32 UID ausgelesen und gespeichert: %s\r\n", uidStr);

  //
  printf("Size of MessageForWebSocket: %lu bytes\n", (unsigned long)sizeof(MessageForWebSocket));







  /* USER CODE END 2 */

  /* Init scheduler */
  osKernelInitialize();
  /* Create the mutex(es) */
  /* creation of gControllerStateMutex */
  gControllerStateMutexHandle = osMutexNew(&gControllerStateMutex_attributes);

  /* creation of gGrowCycleConfigMutex */
  gGrowCycleConfigMutexHandle = osMutexNew(&gGrowCycleConfigMutex_attributes);

  /* USER CODE BEGIN RTOS_MUTEX */
  /* add mutexes, ... */
  /* USER CODE END RTOS_MUTEX */

  /* USER CODE BEGIN RTOS_SEMAPHORES */
  /* add semaphores, ... */
  /* USER CODE END RTOS_SEMAPHORES */

  /* USER CODE BEGIN RTOS_TIMERS */
  /* start timers, add new ones, ... */
  /* USER CODE END RTOS_TIMERS */

  /* Create the queue(s) */
  /* creation of xWaterControllerQueue */
  xWaterControllerQueueHandle = osMessageQueueNew (1, sizeof(uint8_t), &xWaterControllerQueue_attributes);

  /* creation of xLightControllerQueue */
  xLightControllerQueueHandle = osMessageQueueNew (1, sizeof(uint8_t), &xLightControllerQueue_attributes);

